app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "os"], ["created_at", "2022-09-30 22:37:45.700442"], ["updated_at", "2022-09-30 22:37:45.700442"]]
---
     def create
          @book = Book.new(bookParams)

          respond_to do |format|
               if @book.save

UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "spring in action edition2"], ["updated_at", "2022-10-02 14:42:46.387318"], ["id", 2]]
---
     def update
          respond_to do |format|
               if @book.update(bookParams)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
     def setBook
          @book = Book.find(params[:id])